var APP_DATA = {
  "scenes": [
    {
      "id": "0-",
      "name": "迪士尼加州冒險樂園",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 3.0376351956640946,
        "pitch": -0.13396118654790357,
        "fov": 1.2752188746020257
      },
      "linkHotspots": [],
      "infoHotspots": [
        {
          "yaw": 2.701347341670197,
          "pitch": -0.08208117075410826,
          "title": "迪士尼假期",
          "text": "迪士尼假期是位於迪士尼加州冒險樂園的特別活動。迎接季節性的多元化文化慶祝活動，為所有人帶來音樂、美食和樂趣。"
        },
        {
          "yaw": -2.9147339450595062,
          "pitch": -0.15178313918315567,
          "title": "超特攻雲霄飛車",
          "text": "《超特攻雲霄飛車》是在皮克斯碼頭的「超人特攻隊公園」的附近，設計了封閉的隧道、特效和場景，更請到了電影《超人特攻隊2》作曲家譜曲，為這個遊樂設施帶來更多的「超人」樂趣。"
        },
        {
          "yaw": -2.457687050944184,
          "pitch": -0.3490019429112383,
          "title": "皮克斯夥伴摩天輪",
          "text": "<div>《皮克斯夥伴摩天輪》有兩種不同的車廂，一般車廂和搖晃車廂。當你沿著摩天輪的軌道緩慢運行時，你的車廂也會不時前後擺動和滑動，讓整個體驗刺激感大幅上升。</div><div>你準備好起飛、升空至45米的高空，來一趟瘋狂的翱翔了嗎？</div>"
        },
        {
          "yaw": 1.8750299614087398,
          "pitch": -0.19987413851928082,
          "title": "皮克斯碼頭",
          "text": "河岸對面是迪士尼加州冒險樂園的八大主題區之一 : 皮克斯碼頭，把皮克斯動畫膾炙人口的電影著作融入樂園中，包含了腦筋急轉彎、玩具總動員、超人特攻隊和怪獸電力公司等，如果你是皮克斯的大粉絲，千萬不能錯過這個主題樂園"
        },
        {
          "yaw": -0.312935065345572,
          "pitch": 0.10946189085800029,
          "title": "遊行花園",
          "text": "以加州氣氛爲主題的園區，主要遊樂設施有小美人魚的海底冒險、高飛的空中學院，以及色彩世界(晚間表演)，還有各種的獨特高速遊樂設施：《金色風暴》、《高飛的空中學園》、《跳耀水母》、《糊塗交響曲》。"
        }
      ]
    }
  ],
  "name": "home",
  "settings": {
    "mouseViewMode": "drag",
    "autorotateEnabled": true,
    "fullscreenButton": true,
    "viewControlButtons": true
  }
};
