var APP_DATA = {
  "scenes": [
    {
      "id": "0-",
      "name": "香港迪士尼樂園",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2000,
      "initialViewParameters": {
        "yaw": -0.13169943250928284,
        "pitch": 0.6720951458415421,
        "fov": 1.2752188746020257
      },
      "linkHotspots": [
        {
          "yaw": -0.5347762478977724,
          "pitch": 0.16341269768373934,
          "rotation": 0,
          "target": "4-"
        },
        {
          "yaw": 0.5788595783412482,
          "pitch": 0.25392562672398533,
          "rotation": 0,
          "target": "2-"
        },
        {
          "yaw": -0.05922144155064046,
          "pitch": 1.5009599502703175,
          "rotation": 0,
          "target": "1-"
        },
        {
          "yaw": -1.0303587455909664,
          "pitch": 0.20855975808370353,
          "rotation": 0,
          "target": "5-"
        },
        {
          "yaw": -3.0863098489097975,
          "pitch": 0.6083227824584814,
          "rotation": 0,
          "target": "3-"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 0.005086214437920233,
          "pitch": 0.38345155179043644,
          "title": "香港迪士尼樂園",
          "text": "香港迪士尼樂園為全球第5座與亞洲第2座迪士尼樂園，雖然面積較東京迪士尼小，但還是包括了7個園區，還有全球迪士尼樂園中最大的「探險世界」及兩個全球獨有園區「灰熊山谷」和「迷離莊園」。"
        }
      ]
    },
    {
      "id": "1-",
      "name": "香港迪士尼城堡廣場",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1344,
      "initialViewParameters": {
        "yaw": 1.941943032616611,
        "pitch": 0.05434842562049269,
        "fov": 1.2752188746020257
      },
      "linkHotspots": [
        {
          "yaw": -1.057543683436915,
          "pitch": -0.035541307376092846,
          "rotation": 0,
          "target": "3-"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 1.9463459977933821,
          "pitch": -0.32121924500389554,
          "title": "奇幻夢想城堡",
          "text": "<div>香港迪士尼標誌建築。</div><div>正如其名，這座城堡充滿許多奇妙的小細節，在護城河堤邊、城堡中樞區域或是高塔頂端，遊客都能發現許多意想不到的奇妙小彩蛋藏在其中，如白雪公主中的毒蘋果、灰姑娘的馬車、艾莎的冰霜、貝兒的永生玫瑰花……等等，都藏密在城堡中的各個角落等著你來發掘呢!</div>"
        },
        {
          "yaw": -0.7836910880129544,
          "pitch": 0.42048855793717443,
          "title": "迪士尼飛天巡遊",
          "text": "迪士尼飛天巡遊是於香港迪士尼樂園的其中一個五周年慶祝頭炮活動。於每天下午由幻想世界的故事劇場開始，在指定地點花車會升至約四十呎高空表演，並於美國小鎮大街結束。 是全球獨家的迪士尼巡遊表演代替原來的迪士尼巡遊表演。"
        }
      ]
    },
    {
      "id": "2-",
      "name": "小小世界",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1728,
      "initialViewParameters": {
        "yaw": -0.7159411829609432,
        "pitch": 0.022812758225590812,
        "fov": 1.2752188746020257
      },
      "linkHotspots": [],
      "infoHotspots": [
        {
          "yaw": -0.751255484665105,
          "pitch": -0.012512699477349898,
          "title": "小小世界",
          "text": "在各地小朋友齊聲歡唱的歌聲中，搭乘小船環遊繽紛世界。<div>位於幻想世界園區的遊樂設施。<div>是各迪士尼樂園內的一個遊樂設施。小小世界分別位於迪士尼樂園、神奇王國、東京迪士尼樂園、巴黎迪士尼樂園以及香港迪士尼樂園。</div></div>"
        },
        {
          "yaw": 3.095944496024207,
          "pitch": -0.06293424083595056,
          "title": "幻想世界",
          "text": "香港迪士尼樂園裡其中一個主題園區。迪士尼樂園的幻想世界和巴黎迪士尼樂園相同，以「用看的、靜靜欣賞」的遊樂設施居多，可以搭乘的遊樂設施較少。"
        }
      ]
    },
    {
      "id": "3-",
      "name": "美國小鎮大街",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        }
      ],
      "faceSize": 1024,
      "initialViewParameters": {
        "yaw": -0.9897702402227999,
        "pitch": 0.002534218687724632,
        "fov": 1.2752188746020257
      },
      "linkHotspots": [
        {
          "yaw": 2.140507740345077,
          "pitch": -0.04372353631584325,
          "rotation": 0,
          "target": "1-"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -1.9544474024874638,
          "pitch": -0.10882506407092762,
          "title": "動畫藝術廊",
          "text": "於這裡欣賞製作動畫電影背後的手稿。「奇妙處處通」會員服務中心亦位於此處。"
        },
        {
          "yaw": -0.9163042705853073,
          "pitch": -0.21993250665869724,
          "title": "香港迪士尼樂園鐵路－小鎮大街火車站",
          "text": "在世紀交匯的美國小鎮登上懷舊蒸汽火車，沿途欣賞香港迪士尼樂園的極緻景色。"
        },
        {
          "yaw": -1.0133325835594622,
          "pitch": 0.01136782193169239,
          "title": "小鎮大街古董車",
          "text": "乘坐迷人的古董車，在美國小鎮大街上展開愉快的懷舊之旅。"
        },
        {
          "yaw": -1.710058904502267,
          "pitch": -0.07762234165374693,
          "title": "動畫藝術教室",
          "text": "迪士尼動畫師開班授課了！在全長20分鐘的課堂中，迪士尼動畫師將以廣東話親身向一眾學員傳授繪畫迪士尼朋友的秘訣，讓你搖身一變成為動畫大師！"
        },
        {
          "yaw": 1.235387835645362,
          "pitch": -0.10616247527244127,
          "title": "美國小鎮大街",
          "text": "香港迪士尼樂園7大主題園區之一，以復古的形式展現了20世紀初美國市井風貌的美國小鎮景觀。磚砌的街道兩側有市政大廳、消防局、戲院，還有各式售賣紀念品和糕餅的小店。"
        }
      ]
    },
    {
      "id": "4-",
      "name": "反斗奇兵大本營",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1344,
      "initialViewParameters": {
        "yaw": -0.08192361795075165,
        "pitch": -0.043081717691439536,
        "fov": 1.2752188746020257
      },
      "linkHotspots": [],
      "infoHotspots": [
        {
          "yaw": 0.0869404065193784,
          "pitch": 0.027105836885080947,
          "title": "轉轉彈弓狗",
          "text": "齊齊來坐上迪士尼•彼思動畫電影《反斗奇兵》的彈弓狗，和它一起追逐自己的尾巴，圍著巨型大碟瘋狂旋轉！"
        },
        {
          "yaw": -1.017869311365173,
          "pitch": -0.039560977823423826,
          "title": "反斗奇兵大本營",
          "text": "香港迪士尼樂園7大主題園區之一，是一個富含故事與劇情的主題樂園，為提升香港旅遊競爭力作出很大貢獻。在大本營內，可以與小綠人特警巡邏隊合影，與各種巨型玩具一起歷險，創造屬於自己的動畫故事。"
        },
        {
          "yaw": 1.306221400743551,
          "pitch": -0.3978237122771464,
          "title": "玩具兵團跳降傘",
          "text": "齊齊加入《反斗奇兵》玩具兵團的跳降傘訓練，體驗從天而降的快感！"
        },
        {
          "yaw": -1.9953031601601232,
          "pitch": -0.24192673802551923,
          "title": "沖天遙控車",
          "text": "坐上遙控車，在「U」形軌道上來回高速馳騁，享受一飛沖天的刺激快感。"
        },
        {
          "yaw": -1.1709517360861916,
          "pitch": 0.03816708821827497,
          "title": "歡樂桶",
          "text": "胡迪和翠絲會在這個有趣的照相區和你開心合照，讓你留下美好回憶。"
        }
      ]
    },
    {
      "id": "5-",
      "name": "迷離莊園",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "yaw": -0.22440086184716712,
        "pitch": -0.21540925158173962,
        "fov": 1.2752188746020257
      },
      "linkHotspots": [],
      "infoHotspots": [
        {
          "yaw": -0.10210555889879025,
          "pitch": -0.43553153174001125,
          "title": "迷離大宅",
          "text": "探索奇幻的博物館，親眼見證來自世界各地的珍奇展品在你面前活起來，大開奇幻眼界！"
        },
        {
          "yaw": -0.5419081222974746,
          "pitch": 0.18646806502819935,
          "title": "迷離莊園",
          "text": "香港迪士尼7大主題園區之一。<div>故事講述一位英國探險家兼任冒險家・探險家學會成員──亨利爵士於熱帶雨林設立一座大宅並將地庫改為博物館，供予賓客參觀，博物館內擺放著不同的收藏品。</div>"
        },
        {
          "yaw": 1.3226766398596812,
          "pitch": -0.045017128473304524,
          "title": "奇幻庭園",
          "text": "<div>「奇幻庭園」位於迷離大宅對面，庭園裡的奇幻珍品會為你帶來超乎想象、疑幻疑真的視覺效果，挑戰你的視覺極限。&nbsp;</div><div>漫步「奇幻庭園」，觀賞古代雕塑群營造出的神奇3D幻景。</div>"
        },
        {
          "yaw": -2.559694002194071,
          "pitch": -0.23776279702445535,
          "title": "迷離莊園貨運站",
          "text": "為方便運載從世界各地搜羅的收藏品，「迷離大宅」對面設有專屬的「迷離莊園貨運站」，展示了波塞冬的石雕頭像、埃及的伊希斯浮雕和瑪雅帕考國王的雕像等等最新出土的稀世奇珍，你豈可錯過這個千載難逢的合照機會？"
        }
      ]
    }
  ],
  "name": "香港迪士尼",
  "settings": {
    "mouseViewMode": "drag",
    "autorotateEnabled": true,
    "fullscreenButton": false,
    "viewControlButtons": false
  }
};
