var APP_DATA = {
  "scenes": [
    {
      "id": "0-",
      "name": "迪士尼加州冒險樂園",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 3.1064783314522835,
        "pitch": -0.15205312126391135,
        "fov": 1.2752188746020257
      },
      "linkHotspots": [],
      "infoHotspots": [
        {
          "yaw": -2.4149847257846666,
          "pitch": -0.30192481852999364,
          "title": "皮克斯夥伴摩天輪",
          "text": "<div>《皮克斯夥伴摩天輪》有兩種不同的車廂，一般車廂和搖晃車廂。當你沿著摩天輪的軌道緩慢運行時，你的車廂也會不時前後擺動和滑動，讓整個體驗刺激感大幅上升。<br></div><div>你準備好起飛、升空至45米的高空，來一趟瘋狂的翱翔了嗎？<br></div>"
        },
        {
          "yaw": 2.637657575859656,
          "pitch": -0.10214081443886691,
          "title": "迪士尼假期",
          "text": "<div>迪士尼假期是位於迪士尼加州冒險樂園的特別活動。迎接季節性的多元化文化慶祝活動，為所有人帶來音樂、美食和樂趣。</div>"
        },
        {
          "yaw": 1.8453576723263199,
          "pitch": -0.11915226065172746,
          "title": "皮克斯碼頭",
          "text": "河岸對面是迪士尼加州冒險樂園的八大主題區之一 : 皮克斯碼頭，把皮克斯動畫膾炙人口的電影著作融入樂園中，包含了腦筋急轉彎、玩具總動員、超人特攻隊和怪獸電力公司等，如果你是皮克斯的大粉絲，千萬不能錯過這個主題樂園"
        },
        {
          "yaw": -0.32168038317898606,
          "pitch": 0.09145599165453078,
          "title": "遊行花園",
          "text": "<div>以加州氣氛爲主題的園區，主要遊樂設施有小美人魚的海底冒險、高飛的空中學院，以及色彩世界(晚間表演)，還有各種的獨特高速遊樂設施：《金色風暴》、《高飛的空中學園》、《跳耀水母》、《糊塗交響曲》。</div>"
        },
        {
          "yaw": -2.9139441439279974,
          "pitch": -0.1662162370392153,
          "title": "超特攻雲霄飛車",
          "text": "《超特攻雲霄飛車》是在皮克斯碼頭的「超人特攻隊公園」的附近，設計了封閉的隧道、特效和場景，更請到了電影《超人特攻隊2》作曲家譜曲，為這個遊樂設施帶來更多的「超人」樂趣。"
        }
      ]
    },
    {
      "id": "1-",
      "name": "東京迪士尼樂園",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        }
      ],
      "faceSize": 1024,
      "initialViewParameters": {
        "yaw": 0.12466637514245704,
        "pitch": -0.038013280315993825,
        "fov": 1.2752188746020257
      },
      "linkHotspots": [
        {
          "yaw": -0.045329122490990414,
          "pitch": -0.19577514202921265,
          "rotation": 0,
          "target": "2-"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 0.06473366954076099,
          "pitch": -0.46803392136180655,
          "title": "灰姑娘城堡",
          "text": "灰姑娘城堡是位於神奇王國和東京迪士尼樂園這兩個迪士尼樂園中的城堡，也是這兩地的地標。<div>灰姑娘城堡借鑑了迪士尼自己的睡美人城堡，比起睡美人城堡的德國風格，灰姑娘城堡更加有法國風格。</div>"
        },
        {
          "yaw": 3.1281939270039585,
          "pitch": -0.04145384859583068,
          "title": "世界市集",
          "text": "<div>東京迪士尼樂園7大主題區域之一。</div><div>20世紀初期活力四射的美國街道</div><div>夢想與魔法的故事正始於這座滿懷理想的小鎮。在電燈取代煤氣燈、汽車取代馬車，新發明如雨後春筍般問世的時代，這座維多利亞唯美風格建築鱗次櫛比的小鎮，也到處洋溢著生氣蓬勃的氣息。嶄新一日的故事篇章，就由此揭開序幕。</div>"
        }
      ]
    },
    {
      "id": "2-",
      "name": "夢幻樂園",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1920,
      "initialViewParameters": {
        "yaw": -1.697734118596852,
        "pitch": -0.10325907565746562,
        "fov": 1.2752188746020257
      },
      "linkHotspots": [
        {
          "yaw": 2.424584800675671,
          "pitch": -0.01107387772295354,
          "rotation": 0,
          "target": "3-"
        },
        {
          "yaw": -1.6270822469913853,
          "pitch": 0.02199625539740957,
          "rotation": 0,
          "target": "1-"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 1.587058181845328,
          "pitch": -0.0932496302997805,
          "title": "城堡旋轉木馬",
          "text": "<div>色彩繽紛、裝飾華美的一匹匹白馬皆已準備就緒，靜靜地恭候著領您進入迪士尼電影《仙履奇緣》的世界。現在就以王子、公主的心情騎上您喜愛的白馬，盡情享受一段充滿夢想與希望的童話時光吧！</div>"
        },
        {
          "yaw": 1.540061200759827,
          "pitch": 0.39286516083250334,
          "title": "夢幻樂園",
          "text": "<div>東京迪士尼樂園7大主題區域之一。</div><div>不但能沉浸於《仙履奇緣》、《木偶奇遇記》、《美女與野獸》等迪士尼電影的世界中，還能造訪幽靈居住的陰森大宅邸，或是展開航海旅程與世界各國的小朋友相遇。<br></div>"
        },
        {
          "yaw": 0.16694003048736406,
          "pitch": -0.1184278318835581,
          "title": "白雪公主冒險旅程",
          "text": "<div>循著蜿蜒的小路進入昏暗幽深的森林，您將身歷其境地目睹白雪公主的冒險旅程。</div><div>一路上，七個小矮人、居心叵測地兜售毒蘋果的巫婆都將陸續登場。究竟白雪公主將如何逃過一劫？而您又能否從這座詭譎的森林中平安歸來呢？</div><div><br></div>"
        },
        {
          "yaw": 2.1944301329440696,
          "pitch": -0.07692342223132087,
          "title": "愛麗絲的午茶派對",
          "text": "坐進五彩繽紛的午茶杯，一場隨著音樂不斷旋轉的午茶派對即將開始！當您自在隨意地轉動方向盤變換旋轉方向與速度時，可愛的睡鼠還會從中央的大茶壺探出頭來問候您喔！<div><br></div>"
        },
        {
          "yaw": -1.6399113477594547,
          "pitch": -0.1606685282970357,
          "title": "仙履奇緣童話大廳",
          "text": "<div>「灰姑娘」仙度瑞拉在神奇魔法的穿針引線中與王子相遇後，希望與每位遊客分享她的故事，於是蒐集了各種相關的藝術作品，並且開放了城堡讓所有年齡層的訪客自由參觀。</div><div><br></div>"
        },
        {
          "yaw": 0.8592860355349181,
          "pitch": -0.03408801400069805,
          "title": "小飛象",
          "text": "擁有一對大耳朵的小飛象，是全世界唯一會飛的大象。平時在馬戲團大受歡迎的牠，今天將載著您高高飛向青天！隨著小老鼠提摩太的指揮飛上飛下，將全部煩惱都拋到九霄雲外，盡情享受一場愉快的空中之旅吧！<div><br></div>"
        },
        {
          "yaw": 0.3954936816924963,
          "pitch": -0.09708308284361777,
          "title": "小飛俠天空之旅",
          "text": "來！搭上飛天海盜船，由星空下的倫敦一路航向夢幻島！迪士尼電影《小飛俠》中令人嚮往的冒險就在前方，一場生動活潑的旅程即將開始！"
        },
        {
          "yaw": 2.5530754768382167,
          "pitch": -0.06809927837098684,
          "title": "小木偶奇遇記",
          "text": "小木偶皮諾丘歷經重重冒險之後，能否實現他的心願成為真正的小男孩呢？搭上巡遊車出發，迪士尼電影《木偶奇遇記》的精彩故事將一幕幕在您眼前上演。"
        },
        {
          "yaw": 1.0538388801917282,
          "pitch": -0.14786021364974822,
          "title": "幽靈公館",
          "text": "在這棟瀰漫著詭譎氛圍的哥德式大宅中，999 隻幽靈滿心期待有來訪遊客願意填補最後一個空缺。眼睛發出陰森光芒的肖像畫、無人彈奏卻突然響起的鋼琴，各種光怪陸離的現象將接連發生。甚至在不知不覺中，他們就坐在您的身邊…"
        },
        {
          "yaw": 3.0516620900401463,
          "pitch": -0.11681406507654657,
          "title": "米奇魔法交響樂",
          "text": "<div>充滿神奇魔法的演奏會，將為您帶來視覺與聽覺的歡樂雙重饗宴！米奇、唐老鴨以及許多的迪士尼明星都會在此與您相遇。當簾幕揭開，就讓唐老鴨領您進入令人屏息的迪士尼動畫世界吧！</div>"
        }
      ]
    },
    {
      "id": "3-",
      "name": "卡通城",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2000,
      "initialViewParameters": {
        "yaw": -2.2779233994028054,
        "pitch": -0.1136238471491744,
        "fov": 1.2752188746020257
      },
      "linkHotspots": [
        {
          "yaw": 2.1028211329684217,
          "pitch": -0.17554301176639875,
          "rotation": 0,
          "target": "2-"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 2.0098552601661215,
          "pitch": 0.16131201585546684,
          "title": "卡通城",
          "text": "<div>東京迪士尼樂園7大主題區域之一。</div><div>米奇與好友居住的逗趣城鎮。<br></div><div>眾人和樂度日的這座城鎮總是妙趣橫生。</div><div>歡迎來到迪士尼明星（迪士尼動畫的角色）居住、工作及遊玩的快樂城鎮。您可透過視覺、聽覺、觸覺，玩遍這座妙趣橫生的幽默城鎮。</div>"
        },
        {
          "yaw": 1.7360196274219746,
          "pitch": -0.08054406001217629,
          "title": "卡通公園",
          "text": "<div>卡通城內的小公園裡滿是可愛的雕像。材質柔軟的動物、星星等，各個都是米奇發揮藝術天分為小朋友精心製作的呢！歡迎小朋友在這裡爬上爬下、鑽東鑽西，自由地蹦跳玩耍！</div>"
        },
        {
          "yaw": -1.9988054319966047,
          "pitch": -0.1695818075712232,
          "title": "兔子羅傑卡通轉轉車",
          "text": "坐上計程車，鑽入卡通城的後街小巷兜風吧！不過路上千萬要當心，一幫壞心的黃鼠狼正在潑灑毒藥，打算讓兔子羅傑從此消失無蹤。當您欣賞沿途景色時可別忘記避開綠色的毒藥，平安歸來喔！"
        },
        {
          "yaw": 1.3363254366685062,
          "pitch": -0.192499152513955,
          "title": "更多設施",
          "text": "卡通成內往後走有更多設施，艾芝迷你雲霄飛車、高飛遊漆屋、奇奇帝帝橡樹屋、唐老鴨汽船、米妮公館。"
        }
      ]
    },
    {
      "id": "4-",
      "name": "東京迪士尼海洋",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        }
      ],
      "faceSize": 1024,
      "initialViewParameters": {
        "yaw": -1.6528649018092256,
        "pitch": -0.06588968588103938,
        "fov": 1.2752188746020257
      },
      "linkHotspots": [
        {
          "yaw": -1.9309277273256757,
          "pitch": -0.23282445202517366,
          "rotation": 0,
          "target": "5-"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -1.7085081726786466,
          "pitch": 0.037702293480768034,
          "title": "地中海港灣",
          "text": "<div>浪漫風光的南歐港鎮。</div><div>地中海港灣有如一座古典浪漫的南歐港都，亦是環遊東京迪士尼海洋的起點。本主題海港由如詩如畫的漁村、唯美浪漫的運河、大航海時代的要塞 3 個區域所構成，帶領遊客前往滿載冒險與發現的世界。<br></div>"
        },
        {
          "yaw": -2.021247714835914,
          "pitch": -0.09692360964640834,
          "title": "要塞探險「挑戰李奧納多」",
          "text": "來到這裡彷彿回到了充滿冒險與新發現的大航海時代。整座要塞與靠岸中的大帆船都是您的的舞台，瞭望台、大砲、各種航海道具任您操作。快來隨意探索，滿足無止盡的好奇心！"
        },
        {
          "yaw": -3.0606681105744897,
          "pitch": -0.05089905060921396,
          "title": "威尼斯貢多拉遊船",
          "text": "<div>放鬆心情，享受波光粼粼、優雅浪漫的貢多拉之旅吧！</div><div>活潑又健談的船夫將輕巧地撐篙划槳帶您鑽過一座座橋樑，巡遊美麗的運河一圈。</div>"
        },
        {
          "yaw": -1.2086178397128062,
          "pitch": -0.07312099955355578,
          "title": "迪士尼海洋渡輪航線",
          "text": "<div>徐徐航行的蒸汽船是您一覽園區風光的好幫手。燦爛陽光下，輕快樂曲將伴您展開充滿活力的冒險航程；夕陽西落後，海港霓燈倒映水面的美景將為遊園回憶更添浪漫色彩。現在就來趟舒適愜意的水上之旅吧！</div>"
        }
      ]
    },
    {
      "id": "5-",
      "name": "神秘島",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        }
      ],
      "faceSize": 1024,
      "initialViewParameters": {
        "yaw": -0.4994656803710491,
        "pitch": 0.1912896416291492,
        "fov": 1.2752188746020257
      },
      "linkHotspots": [
        {
          "yaw": 1.1570479676731935,
          "pitch": -0.04132710729726696,
          "rotation": 0,
          "target": "4-"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -2.3100965796944326,
          "pitch": -0.14933213620141572,
          "title": "地心探險之旅",
          "text": "鼓起勇氣參加地心探險之旅，前往神祕的天才科學家尼默船長發現的地底世界吧！當您身處在充滿驚奇的景觀中，不禁讚嘆大自然的鬼斧神工時，卻突然遇上一陣天搖地動！難道，沉寂已久的火山就要爆發了？"
        },
        {
          "yaw": 0.5308201326651378,
          "pitch": 0.004744174644997656,
          "title": "海底兩萬哩",
          "text": "擁有高度文明卻離奇消失的亞特蘭提斯大陸，據說仍然現存在湛藍深洋中，且居民們也適應了水中的環境。傳說究竟是真是假呢？歡迎您坐進裝載了強力探照燈的小型潛水艇，展開充滿驚奇與冒險的海底之旅！"
        },
        {
          "yaw": -0.4210059661444081,
          "pitch": -0.24695639080501053,
          "title": "神秘島",
          "text": "<div>東京迪士尼海洋8大主題海港之一。</div><div>天才科學家尼默船長充滿驚奇的祕密基地。</div><div>神祕天才科學家尼默船長的祕密基地就隱藏在這座仍在活動的破火山口。在此進行的各種研究將不可能化為可能，超乎世人想像。遊客可搭乘尼默船長研發的地底行走車、小型潛水艇，探索神祕的未知世界。<br></div>"
        }
      ]
    },
    {
      "id": "6-",
      "name": "發現港",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        }
      ],
      "faceSize": 1024,
      "initialViewParameters": {
        "yaw": -0.2369305626308975,
        "pitch": -0.0906528349173712,
        "fov": 1.2752188746020257
      },
      "linkHotspots": [
        {
          "yaw": 0.011782125171100333,
          "pitch": -0.18916574047370638,
          "rotation": 0,
          "target": "5-"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.9484762933229121,
          "pitch": 0.14074400167306322,
          "title": "發現港",
          "text": "<div>東京迪士尼海洋8大主題海港之一。</div><div>超越時空的未來港口。</div><div>發現港是大自然與科學和諧共生的美好未來世界。遊客可坐上無法預測行駛路徑的小艇，或是搭乘特殊的潛水艇前往遼闊的海洋世界冒險。<br></div>"
        },
        {
          "yaw": 1.3730100441098259,
          "pitch": -0.18874784884769014,
          "title": "水上逗趣船",
          "text": "<div>搭上可供 3 人搭乘的水上逗趣船，一段難以料想的歡樂時刻就此展開。逗趣船將一會兒突然轉彎、一會兒在原地打轉，穿梭在漩渦、瀑布、間歇泉之間。令人無法預測的行駛路徑，就像是闖入了水上迷宮一般！</div>"
        },
        {
          "yaw": -0.9291436932511292,
          "pitch": -0.1493669146242258,
          "title": "迪士尼海洋電氣化鐵路",
          "text": "<div>搭上可愛醒目的復古電車，超越時空回到 20 世紀初葉的美國海濱吧！隨著列車一搖一晃的悠閒節奏由車廂瞭望遠方，居高臨下的好風光盡收眼底！</div>"
        },
        {
          "yaw": -2.458425384705645,
          "pitch": -0.2102953287304974,
          "title": "海底巡遊艇:莫尼&amp;好友的海洋世界",
          "text": "<div>快來搭上「海底巡遊艇」縮小成魚兒尺寸，與尼莫、多莉一同前往海洋世界冒險吧！</div><div>遼闊的大海處處充滿新鮮事，旅途中說不定還能遇到章魚「七條郎」、鯨鯊「命運」等迪士尼‧皮克斯電影《海底總動員》系列中耳熟能詳的迪士尼明星呢！</div>"
        }
      ]
    },
    {
      "id": "7-",
      "name": "東京迪士尼大飯店",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "yaw": 0.2297423199053874,
        "pitch": -0.22301124452039822,
        "fov": 1.2752188746020257
      },
      "linkHotspots": [],
      "infoHotspots": [
        {
          "yaw": 0.05822163726085705,
          "pitch": -0.7794646779702745,
          "title": "東京迪士尼海洋觀海景大飯店",
          "text": "<div>暢遊園區的歡欣悸動縈繞身旁，可住宿於東京迪士尼海洋的飯店。</div><div>東京迪士尼海洋觀海景大飯店擁有與東京迪士尼海洋融合為一的建築設計，令遊客暢遊園區的歡欣悸動延續至客房。華麗優雅的館內空間洋溢著濃郁的義大利古都氛圍，領您在星空下回顧當日冒險，並於晨光中邁向全新旅程！</div>"
        }
      ]
    },
    {
      "id": "8-",
      "name": "香港迪士尼樂園",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2000,
      "initialViewParameters": {
        "yaw": -0.22366624578538463,
        "pitch": 0.6859360894248052,
        "fov": 1.2748843546439028
      },
      "linkHotspots": [
        {
          "yaw": 0.5625577887879167,
          "pitch": 0.2713100654210585,
          "rotation": 0,
          "target": "10-"
        },
        {
          "yaw": -0.5524460013651371,
          "pitch": 0.1925311526470086,
          "rotation": 0,
          "target": "13-"
        },
        {
          "yaw": -3.0966554176167485,
          "pitch": 0.6138451532743492,
          "rotation": 0,
          "target": "12-"
        },
        {
          "yaw": -1.054971937532395,
          "pitch": 0.23256050694668673,
          "rotation": 0,
          "target": "11-"
        },
        {
          "yaw": -0.10438247499330622,
          "pitch": 1.5217051782129172,
          "rotation": 0,
          "target": "9-"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.0012978986204075227,
          "pitch": 0.3855531897706381,
          "title": "香港迪士尼樂園",
          "text": "香港迪士尼樂園為全球第5座與亞洲第2座迪士尼樂園，雖然面積較東京迪士尼小，但還是包括了7個園區，還有全球迪士尼樂園中最大的「探險世界」及兩個全球獨有園區「灰熊山谷」和「迷離莊園」。"
        }
      ]
    },
    {
      "id": "9-",
      "name": "香港迪士尼城堡廣場",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1344,
      "initialViewParameters": {
        "yaw": -1.0087382149985622,
        "pitch": 0.006728380294905634,
        "fov": 1.2752188746020257
      },
      "linkHotspots": [
        {
          "yaw": -0.9978190999282788,
          "pitch": -0.04171608117997039,
          "rotation": 0,
          "target": "12-"
        },
        {
          "yaw": -3.024897423819805,
          "pitch": -0.17142267018674318,
          "rotation": 0,
          "target": "10-"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 1.9208568161147594,
          "pitch": -0.18284853986743776,
          "title": "奇幻夢想城堡",
          "text": "香港迪士尼標誌建築。<div>正如其名，這座城堡充滿許多奇妙的小細節，在護城河堤邊、城堡中樞區域或是高塔頂端，遊客都能發現許多意想不到的奇妙小彩蛋藏在其中，如白雪公主中的毒蘋果、灰姑娘的馬車、艾莎的冰霜、貝兒的永生玫瑰花……等等，都藏密在城堡中的各個角落等著你來發掘呢!</div>"
        },
        {
          "yaw": -0.7732164514497928,
          "pitch": 0.39046498225371096,
          "title": "迪士尼飛天巡遊",
          "text": "迪士尼飛天巡遊是於香港迪士尼樂園的其中一個五周年慶祝頭炮活動。於每天下午由幻想世界的故事劇場開始，在指定地點花車會升至約四十呎高空表演，並於美國小鎮大街結束。 是全球獨家的迪士尼巡遊表演代替原來的迪士尼巡遊表演。"
        }
      ]
    },
    {
      "id": "10-",
      "name": "小小世界",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1728,
      "initialViewParameters": {
        "yaw": -0.6642134778652782,
        "pitch": -0.035479061628244324,
        "fov": 1.2752188746020257
      },
      "linkHotspots": [],
      "infoHotspots": [
        {
          "yaw": -0.6642134778652782,
          "pitch": -0.035479061628244324,
          "title": "小小世界",
          "text": "在各地小朋友齊聲歡唱的歌聲中，搭乘小船環遊繽紛世界。<div>位於幻想世界園區的遊樂設施。<div>是各迪士尼樂園內的一個遊樂設施。小小世界分別位於迪士尼樂園、神奇王國、東京迪士尼樂園、巴黎迪士尼樂園以及香港迪士尼樂園。</div></div>"
        },
        {
          "yaw": 3.08793128916727,
          "pitch": -0.015320101504755712,
          "title": "幻想世界",
          "text": "香港迪士尼樂園裡其中一個主題園區。迪士尼樂園的幻想世界和巴黎迪士尼樂園相同，以「用看的、靜靜欣賞」的遊樂設施居多，可以搭乘的遊樂設施較少。"
        }
      ]
    },
    {
      "id": "11-",
      "name": "迷離莊園",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "yaw": -0.3668753325620724,
        "pitch": -0.3142431172787532,
        "fov": 1.2752188746020257
      },
      "linkHotspots": [],
      "infoHotspots": [
        {
          "yaw": -0.5847787452350488,
          "pitch": 0.11626625345863317,
          "title": "逃離莊園",
          "text": "香港迪士尼7大主題園區之一。<div>故事講述一位英國探險家兼任冒險家・探險家學會成員──亨利爵士於熱帶雨林設立一座大宅並將地庫改為博物館，供予賓客參觀，博物館內擺放著不同的收藏品。<br></div>"
        },
        {
          "yaw": -0.20391478737814062,
          "pitch": -0.42936308645725774,
          "title": "迷離大宅",
          "text": "探索奇幻的博物館，親眼見證來自世界各地的珍奇展品在你面前活起來，大開奇幻眼界！"
        },
        {
          "yaw": 1.3147629214600087,
          "pitch": -0.0807425536885269,
          "title": "奇幻庭園",
          "text": "<div>「奇幻庭園」位於迷離大宅對面，庭園裡的奇幻珍品會為你帶來超乎想象、疑幻疑真的視覺效果，挑戰你的視覺極限。&nbsp;</div><div>漫步「奇幻庭園」，觀賞古代雕塑群營造出的神奇3D幻景。<br></div>"
        },
        {
          "yaw": -2.5920508307399075,
          "pitch": -0.23881683631691963,
          "title": "迷離莊園貨運站",
          "text": "為方便運載從世界各地搜羅的收藏品，「迷離大宅」對面設有專屬的「迷離莊園貨運站」，展示了波塞冬的石雕頭像、埃及的伊希斯浮雕和瑪雅帕考國王的雕像等等最新出土的稀世奇珍，你豈可錯過這個千載難逢的合照機會？"
        }
      ]
    },
    {
      "id": "12-",
      "name": "美國小鎮大街",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        }
      ],
      "faceSize": 1024,
      "initialViewParameters": {
        "yaw": -0.9671124942040059,
        "pitch": -0.053218592442366486,
        "fov": 1.2752188746020257
      },
      "linkHotspots": [
        {
          "yaw": 2.1183260808274387,
          "pitch": -0.034011201057632334,
          "rotation": 0,
          "target": "9-"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 1.214202882791481,
          "pitch": -0.12018923614510868,
          "title": "美國小鎮大街",
          "text": "香港迪士尼樂園7大主題園區之一，以復古的形式展現了20世紀初美國市井風貌的美國小鎮景觀。磚砌的街道兩側有市政大廳、消防局、戲院，還有各式售賣紀念品和糕餅的小店。"
        },
        {
          "yaw": -1.9293890437206471,
          "pitch": -0.1402083826558318,
          "title": "動畫藝術廊",
          "text": "於這裡欣賞製作動畫電影背後的手稿。「奇妙處處通」會員服務中心亦位於此處。"
        },
        {
          "yaw": -1.7116636388768622,
          "pitch": -0.1191873093223208,
          "title": "動畫藝術教室",
          "text": "迪士尼動畫師開班授課了！在全長20分鐘的課堂中，迪士尼動畫師將以廣東話親身向一眾學員傳授繪畫迪士尼朋友的秘訣，讓你搖身一變成為動畫大師！"
        },
        {
          "yaw": -1.0198689948830229,
          "pitch": -0.028826619985974133,
          "title": "小鎮大街古董車",
          "text": "乘坐迷人的古董車，在美國小鎮大街上展開愉快的懷舊之旅。"
        },
        {
          "yaw": -0.9549349884593212,
          "pitch": -0.212086806390813,
          "title": "香港迪士尼樂園鐵路－小鎮大街火車站",
          "text": "在世紀交匯的美國小鎮登上懷舊蒸汽火車，沿途欣賞香港迪士尼樂園的極緻景色。"
        }
      ]
    },
    {
      "id": "13-",
      "name": "反斗奇兵大本營",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1344,
      "initialViewParameters": {
        "yaw": -0.06434335505821842,
        "pitch": -0.0745413342189849,
        "fov": 1.2752188746020257
      },
      "linkHotspots": [],
      "infoHotspots": [
        {
          "yaw": 0.06697927095519063,
          "pitch": -0.00429239704710227,
          "title": "轉轉彈弓狗",
          "text": "齊齊來坐上迪士尼•彼思動畫電影《反斗奇兵》的彈弓狗，和它一起追逐自己的尾巴，圍著巨型大碟瘋狂旋轉！"
        },
        {
          "yaw": -2.0151950156576497,
          "pitch": -0.23666974391806406,
          "title": "沖天遙控車",
          "text": "坐上遙控車，在「U」形軌道上來回高速馳騁，享受一飛沖天的刺激快感。"
        },
        {
          "yaw": -1.1717523877424547,
          "pitch": 0.04248818724851233,
          "title": "歡樂桶",
          "text": "胡迪和翠絲會在這個有趣的照相區和你開心合照，讓你留下美好回憶。"
        },
        {
          "yaw": 1.290919945829339,
          "pitch": -0.4119271189315903,
          "title": "玩具兵團跳降傘",
          "text": "齊齊加入《反斗奇兵》玩具兵團的跳降傘訓練，體驗從天而降的快感！"
        },
        {
          "yaw": -1.0086586952141126,
          "pitch": -0.022995162561169735,
          "title": "反斗奇兵大本營",
          "text": "香港迪士尼樂園7大主題園區之一，是一個富含故事與劇情的主題樂園，為提升香港旅遊競爭力作出很大貢獻。在大本營內，可以與小綠人特警巡邏隊合影，與各種巨型玩具一起歷險，創造屬於自己的動畫故事。"
        }
      ]
    }
  ],
  "name": "迪士尼主題樂園",
  "settings": {
    "mouseViewMode": "drag",
    "autorotateEnabled": true,
    "fullscreenButton": true,
    "viewControlButtons": true
  }
};
